src/tests/load/search-load-test.yml
config:
  target: http://localhost:3000
  phases:
    - duration: 60
      arrivalRate: 50 # Start with 50 users per minute
      rampTo: 250 # Gradually ramp up to 250 users
      name: Warm up phase
    - duration: 120
      arrivalRate: 250 # Maintain 250 users per second
      name: Sustained peak load
    - duration: 60
      arrivalRate: 250 # Start at peak
      rampTo: 50 # Gradually reduce to 50 users per second
      name: Cool down phase
  ensure:
    thresholds:
      - http.response_time.p99: 500 # 99% of requests should be under 500ms
      - http.response_time.p95: 300 # 95% of requests should be under 300ms
      - http.errors.rate: 0.01 # Max error rate of 1%

scenarios:
  - name: 'Search Restaurants by Zip Code'
    flow:
      - get:
          url: '/api/search/zipcode/4000'