src/tests/load/search-load-test.yml
config:
  target: http://localhost:3000
  phases:
    - duration: 60
      arrivalRate: 3000 # Start with 3,000 users per minute
      rampTo: 15000 # Gradually ramp up to 15,000 users
      name: Warm up phase
    - duration: 120
      arrivalRate: 15000 # Maintain 15,000 users per minute
      name: Sustained peak load
    - duration: 60
      arrivalRate: 15000 # Start at peak
      rampTo: 3000 # Gradually reduce to 3,000 users
      name: Cool down phase
  ensure:
    thresholds:
      - http.response_time.p99: 500 # 99% of requests should be under 500ms
      - http.response_time.p95: 300 # 95% of requests should be under 300ms
      - http.errors.rate: 0.01 # Max error rate of 1%

scenarios:
  - name: 'Search Restaurants by Zip Code'
    flow:
      - get:
          url: '/api/search/zipcode/{{ zipcode }}'
    variables:
      zipcode: [4000, 5000, 6000] # Example zip codes for dynamic data